doc: replace to mermaid format diagram
